Functions
skpfilereference.h File Reference
#include <LayOutAPI/common.h>
 #include <LayOutAPI/geometry/geometry.h>
 #include <LayOutAPI/model/defs.h>
 #include <SketchUpAPI/model/defs.h>
Go to the source code of this file.
 Functions
LO_RESULT  | LOSkpFileReferenceCreate (LOSkpFileRef *file_ref, SUModelRef model)
Creates a SketchUp file reference object with a Skp model. This function takes ownership of the given model. Upon success, user should not release the model, or create another LOSkpFileRef with the same model. The model is valid and mutable till the LOSkpFileRef is released. Do not use a model obtained by a 'Get' function such as the LOSketchUpModelGetModel() as the ownership cannot be transfered to the file_ref. More...
LO_RESULT  | LOSkpFileReferenceRelease (LOSkpFileRef *file_ref)
Releases a SketchUp file reference object. More...
LO_RESULT  | LOSketchUpModelCreateWithSkpFileRef (LOSketchUpModelRef *model, LOSkpFileRef file_ref, const LOAxisAlignedRect2D *bounds)
Creates a new SketchUp model object with the specified bounds and file reference. This function increases reference count on the given file reference. More...
LO_RESULT  | LOGroupClipChildren (LOGroupRef group, LOEntityRef clip_mask)
Applies a clip mask to all entities inside a group. Entities outside the clip mask will be removed from the document. Entities that cross the clip mask boundary will be removed but may be replaced by new entities. The clip_mask entity must be a LORectangleRef, LOEllipseRef, or LOPathRef. More...
Function Documentation
 LO_RESULT LOGroupClipChildren  |  ( |  LOGroupRef  |  group,
|  LOEntityRef  |  clip_mask
)
Applies a clip mask to all entities inside a group. Entities outside the clip mask will be removed from the document. Entities that cross the clip mask boundary will be removed but may be replaced by new entities. The clip_mask entity must be a LORectangleRef, LOEllipseRef, or LOPathRef.
Since
LayOut 2018, API 3.0
Parameters
[in] | group | The group to apply the clipmask to.
[in] | clip_mask | The entity to use as a clip mask.
Returns
SU_ERROR_NONE on success
SU_ERROR_ENTITY_LOCKED if group is locked
SU_ERROR_LAYER_LOCKED if group contains entities on locked layers
SU_ERROR_GENERIC if clipping algorithm fails
 LO_RESULT LOSketchUpModelCreateWithSkpFileRef  |  ( |  LOSketchUpModelRef *  |  model,
|  LOSkpFileRef  |  file_ref,
|  const LOAxisAlignedRect2D *  |  bounds
)
Creates a new SketchUp model object with the specified bounds and file reference. This function increases reference count on the given file reference.
Since
LayOut 2018, API 3.0
Parameters
[out] | model | The model entity to be created.
[in] | file_ref | The SketchUp file reference object.
[in] | bounds | The starting dimensions of the model entity.
Returns
SU_ERROR_NONE on success
SU_ERROR_NULL_POINTER_OUTPUT if model is NULL
SU_ERROR_OVERWRITE_VALID if *model already refers to a valid object
SU_ERROR_INVALID_INPUT if file_ref is invalid
SU_ERROR_NULL_POINTER_INPUT if bounds is NULL
SU_ERROR_OUT_OF_RANGE if bounds has a width or height of zero
 LO_RESULT LOSkpFileReferenceCreate  |  ( |  LOSkpFileRef *  |  file_ref,
|  SUModelRef  |  model
)
Creates a SketchUp file reference object with a Skp model. This function takes ownership of the given model. Upon success, user should not release the model, or create another LOSkpFileRef with the same model. The model is valid and mutable till the LOSkpFileRef is released. Do not use a model obtained by a 'Get' function such as the LOSketchUpModelGetModel() as the ownership cannot be transfered to the file_ref.
Since
LayOut 2018, API 3.0
Parameters
[out] | file_ref | The file reference object to be created.
[in] | model | The SketchUp model.
Returns
SU_ERROR_NONE on success
SU_ERROR_NULL_POINTER_OUTPUT if file_ref is NULL
SU_ERROR_OVERWRITE_VALID if *file_ref refers to a valid object
SU_ERROR_INVALID_INPUT if model does not refer to a valid object
 LO_RESULT LOSkpFileReferenceRelease  |  ( |  LOSkpFileRef *  |  file_ref | )
Releases a SketchUp file reference object.
Since
LayOut 2018, API 3.0
Parameters
[in] | file_ref | The SketchUp file reference object.
Returns
SU_ERROR_NONE on success
SU_ERROR_NULL_POINTER_INPUT if file_ref is NULL
SU_ERROR_INVALID_INPUT if *file_ref does not refer to a valid object