Data Fields
SUOverlayDrawFrameInfo Struct Reference
Data that SketchUp will use the to blend the given color/depth buffer onto SketchUp rendering. More...
#include <overlay.h>
 Data Fields
enum SUOverlayDrawFrameInfoVersion  | version
Version of the struct. This will be set by SketchUp. More...
double  | blending_factor
struct SUDrawFrameMemoryBuffer  | color
Color buffer info. ptr points to a uint8_t buffer with 4 channels. More...
struct SUDrawFrameMemoryBuffer  | depth
Depth buffer info. ptr points to a float buffer. More...
void *  | reserved
Reserved for internal use. This will be set to NULL by SketchUp and should not be modified. More...
Detailed Description
Data that SketchUp will use the to blend the given color/depth buffer onto SketchUp rendering.
Field Documentation
 double SUOverlayDrawFrameInfo::blending_factor
Alpha channel of the given color buffer will be multiplied with this value. Must be set to 1.0 if an override is not needed.
 struct SUDrawFrameMemoryBuffer SUOverlayDrawFrameInfo::color
Color buffer info. ptr points to a uint8_t buffer with 4 channels.
 struct SUDrawFrameMemoryBuffer SUOverlayDrawFrameInfo::depth
Depth buffer info. ptr points to a float buffer.
 void* SUOverlayDrawFrameInfo::reserved
Reserved for internal use. This will be set to NULL by SketchUp and should not be modified.
 enum SUOverlayDrawFrameInfoVersion SUOverlayDrawFrameInfo::version
Version of the struct. This will be set by SketchUp.
 The documentation for this struct was generated from the following file:
SketchUpAPI/application/overlay.h