Functions
model.h File Reference
Interfaces for SUModelRef for live access. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/application/overlay.h>
 Functions
enum SUResult  | SUModelCreateOverlay (SUModelRef model, const struct SUOverlayCreateInfo *info, SUOverlayRef *overlay)
Creates an overlay and adds it to the model. More...
enum SUResult  | SUModelReleaseOverlay (SUModelRef model, SUOverlayRef *overlay)
Releases the overlay after removing it from the model. More...
Detailed Description
Interfaces for SUModelRef for live access.
Function Documentation
 enum SUResult SUModelCreateOverlay  |  ( |  SUModelRef  |  model,
|  const struct SUOverlayCreateInfo *  |  info,
|  SUOverlayRef *  |  overlay
)
Creates an overlay and adds it to the model.
Since
SketchUp 2024, API 12.0
Parameters
[in] | model | The model object
[in] | info | The information needed to create the overlay object
[out] | overlay | The created overlay object
Returns
SU_ERROR_NONE on success
SU_ERROR_INVALID_INPUT if model is an invalid object
SU_ERROR_NULL_POINTER_INPUT if info is NULL
SU_ERROR_NULL_POINTER_OUTPUT if overlay is NULL
SU_ERROR_OVERWRITE_VALID if overlay is already a valid object
SU_ERROR_DUPLICATE if the given SUOverlayCreateInfo::id already exists in the model
 enum SUResult SUModelReleaseOverlay  |  ( |  SUModelRef  |  model,
|  SUOverlayRef *  |  overlay
)
Releases the overlay after removing it from the model.
Parameters
[in] | model | The model object
[in,out] | overlay | The overlay object to be released, will be set to NULL on return.
Since
SketchUp 2024, API 12.0
Returns
SU_ERROR_NONE on success
SU_ERROR_INVALID_INPUT if model or overlay is an invalid object
SU_ERROR_NULL_POINTER_INPUT if overlay is NULL
SU_ERROR_NO_DATA if overlay could be found in the model