scene.h File Reference
Interfaces for SUSceneRef. More...
#include <SketchUpAPI/common.h>
 #include <SketchUpAPI/unicodestring.h>
 #include <SketchUpAPI/model/defs.h>
 Macros
Scene Flags
Flags for SUSceneGetFlags() and SUSceneSetFlags(). These are combined bitwise.
See Also
SUSceneRef
 #define  | FLAG_USE_CAMERA
 #define  | FLAG_USE_RENDERING_OPTIONS
 #define  | FLAG_USE_SHADOWINFO
 #define  | FLAG_USE_AXES
 #define  | FLAG_USE_HIDDEN
 #define  | FLAG_USE_LAYER_VISIBILITY
 #define  | FLAG_USE_SECTION_PLANES
 #define  | FLAG_USE_HIDDEN_GEOMETRY
 #define  | FLAG_USE_HIDDEN_OBJECTS
 #define  | FLAG_USE_ALL
 #define  | FLAG_NO_CAMERA
Detailed Description
Interfaces for SUSceneRef.