Public Types | Data Fields
SUModelStatistics Struct Reference
Contains an array of entity counts that can be indexed per entity type. More...
#include <SketchUpAPI/model/model.h>
 Public Types
enum  | SUEntityType {
 SUEntityType_Edge, SUEntityType_Face, SUEntityType_ComponentInstance, SUEntityType_Group,
 SUEntityType_Image, SUEntityType_ComponentDefinition, SUEntityType_Layer, SUEntityType_Material,
 SUNumEntityTypes
 }
Types of SUEntityRef objects. More...
 Data Fields
 int  | entity_counts [SUNumEntityTypes]
Count of each entity type.
Detailed Description
Contains an array of entity counts that can be indexed per entity type.
Member Enumeration Documentation
 enum SUModelStatistics::SUEntityType
Types of SUEntityRef objects.
Enumerator
SUEntityType_Edge
SUEdgeRef entities.
SUEntityType_Face
SUFaceRef entities.
SUEntityType_ComponentInstance
SUComponentInstanceRef entities.
SUEntityType_Group
SUGroupRef entities.
SUEntityType_Image
SUImageRef entities.
SUEntityType_ComponentDefinition
SUComponentDefinitionRef entities.
SUEntityType_Layer
SULayerRef entities.
SUEntityType_Material
SUMaterialRef entities.
SUNumEntityTypes
Number of entity types.
 The documentation for this struct was generated from the following file:
SketchUpAPI/model/model.h