Related Functions
SUOverlayRef Struct Reference
Manages a Overlay object, which is used to blend external images on top of SketchUp rendering. More...
#include <SketchUpAPI/application/overlay.h>
 Related Functions
(Note that these are not member functions.)
enum  | SUOverlayBeginFrameInfoVersion : uint32_t
Available versions for the SUOverlayCreateInfo::version field.
enum  | SUOverlayDrawFrameInfoVersion : uint32_t
Available versions for SUOverlayDrawFrameInfo::version.
enum  | SUOverlayImageFormat : uint8_t
Supported image formats.
enum  | SUOverlayImageOrientation : uint8_t
Supported image orientations.
enum  | SUOverlayCreateInfoVersion : uint32_t
Available versions for the SUOverlayCreateInfo::version field.
 typedef struct SUBoundingBox3D(*  | SUOverlayGetExtentsFuncT )(SUOverlayRef, void *)
Signature for SUOverlayCreateInfo::get_extents callback.
 typedef void(*  | SUOverlayBeginFrameFuncT )(SUOverlayRef, const struct SUBeginFrameInfo *, void *)
Signature for SUOverlayCreateInfo::begin_frame callback.
 typedef void(*  | SUOverlayDrawFrameFuncT )(SUOverlayRef, struct SUOverlayDrawFrameInfo *, void *)
Signature for SUOverlayCreateInfo::draw_frame callback.
 typedef void(*  | SUOverlayEndFrameFuncT )(SUOverlayRef, void *)
Signature for SUOverlayCreateInfo::end_frame callback.
 typedef void(*  | SUOverlayStartFuncT )(SUOverlayRef, void *)
Signature for SUOverlayCreateInfo::start callback.
 typedef void(*  | SUOverlayStopFuncT )(SUOverlayRef, void *)
Signature for SUOverlayCreateInfo::stop callback.
enum SUResult  | SUModelCreateOverlay (SUModelRef model, const struct SUOverlayCreateInfo *info, SUOverlayRef *overlay)
Creates an overlay and adds it to the model. More...
enum SUResult  | SUModelReleaseOverlay (SUModelRef model, SUOverlayRef *overlay)
Releases the overlay after removing it from the model. More...
 #define  | SUOVERLAY_BEGIN_FRAME_INFO_VERSION
Current version of the SUBeginFrameInfo struct.
 #define  | SUOVERLAY_DRAW_FRAME_INFO_VERSION
Current version of SUOverlayDrawFrameInfo struct.
 #define  | SUOVERLAY_CREATE_INFO_VERSION
Current version of the SUOverlayCreateInfo struct.
enum SUResult  | SUOverlayEnable (SUOverlayRef overlay, bool enabled)
Enables or disables an overlay. More...
Detailed Description
Manages a Overlay object, which is used to blend external images on top of SketchUp rendering.
Friends And Related Function Documentation
 enum SUResult SUModelCreateOverlay  |  ( |  SUModelRef  |  model,
|  const struct SUOverlayCreateInfo *  |  info,
|  SUOverlayRef *  |  overlay
)
related
Creates an overlay and adds it to the model.
Since
SketchUp 2024, API 12.0
Parameters
[in] | model | The model object
[in] | info | The information needed to create the overlay object
[out] | overlay | The created overlay object
Returns
SU_ERROR_NONE on success
SU_ERROR_INVALID_INPUT if model is an invalid object
SU_ERROR_NULL_POINTER_INPUT if info is NULL
SU_ERROR_NULL_POINTER_OUTPUT if overlay is NULL
SU_ERROR_OVERWRITE_VALID if overlay is already a valid object
SU_ERROR_DUPLICATE if the given SUOverlayCreateInfo::id already exists in the model
 enum SUResult SUModelReleaseOverlay  |  ( |  SUModelRef  |  model,
|  SUOverlayRef *  |  overlay
)
related
Releases the overlay after removing it from the model.
Parameters
[in] | model | The model object
[in,out] | overlay | The overlay object to be released, will be set to NULL on return.
Since
SketchUp 2024, API 12.0
Returns
SU_ERROR_NONE on success
SU_ERROR_INVALID_INPUT if model or overlay is an invalid object
SU_ERROR_NULL_POINTER_INPUT if overlay is NULL
SU_ERROR_NO_DATA if overlay could be found in the model
 enum SUResult SUOverlayEnable  |  ( |  SUOverlayRef  |  overlay,
|  bool  |  enabled
)
related
Enables or disables an overlay.
Parameters
[in] | overlay | The overlay object
[in] | enabled | Whether to enable or disable
Since
SketchUp 2024, API 12.0
Returns
SU_ERROR_NONE on success
SU_ERROR_INVALID_INPUT if overlay is an invalid object
 The documentation for this struct was generated from the following files:
SketchUpAPI/model/defs.h
SketchUpAPI/application/overlay.h
SketchUpAPI/application/model.h